# ==============================================================================
# LS-Det v1  —  道路病害轻量化检测模型网络结构定义
# LightScan Road Defect Detection Network Architecture
# ==============================================================================
#
# 设计目标
# --------
# 针对城市公路病害（纵向裂缝 / 横向裂缝 / 龟裂 / 坑槽）的视觉特性：
#   1. 裂缝目标极细长（宽度 < 10px），长宽比可达 1:50，常规锚框难以覆盖
#   2. 行车记录仪采集的图像分辨率高（1080P/4K），目标在全图中占比极小
#   3. 路面纹理复杂（积水反光、阴影、标线遮挡），背景干扰强
#
# 架构创新点
# ----------
# 1. 骨干网络采用深度可分离卷积（Depthwise Separable Conv）替代标准卷积，
#    在保持感受野的同时将骨干参数量降低约 40%，满足边缘端部署需求。
# 2. 颈部引入 FPN+PAN 双向特征金字塔，强化 P2（160×160）浅层语义，
#    专为细小裂缝目标的高召回率优化。
# 3. 检测头采用解耦架构（Decoupled Head），分类与回归分支独立优化，
#    有效降低细长目标的误检率。
# 4. 引入 C2PSA（Cross-Stage Partial with Self-Attention）模块，
#    在 P5 特征层捕获全局上下文，辅助坑槽等大面积病害的定位。
#
# 训练数据集
# ----------
# RDD2022（Japan 8,588 + China_Drone 1,957 + China_Motorbike 1,208）
# CROWD 城市行车记录仪数据集（辅助增广）
# 共计 11,753 张标注图像，4 类病害标签
#
# 训练配置（最终收敛）
# --------------------
# 输入分辨率：960×960    优化器：AdamW + 余弦退火
# 总训练轮次：180 epoch  早停触发：epoch 142（patience=40）
# box_loss 权重：7.5     硬件：2× RTX 4060，耗时约 16 h
# ==============================================================================

# 类别数（道路病害 4 类）
nc: 4
# 类别名称（对应 RDD2022 标注体系）
names:
  0: D00   # 纵向裂缝 (Longitudinal Crack)
  1: D10   # 横向裂缝 (Transverse Crack)
  2: D20   # 龟裂     (Alligator Crack)
  3: D40   # 坑槽     (Pothole)

# 模型缩放系数 [depth, width, max_channels]
# LS-Det v1 固定为 Small 级别配置，平衡精度与推理速度
scales:
  v1: [0.50, 0.50, 1024]

# ==============================================================================
# 骨干网络 (Backbone)
# 采用 C3k2 跨阶段局部网络块，depth_multiple=0.5 精简层深
# ==============================================================================
backbone:
  # [from, repeats, module, args]
  # 第 0-1 层保留标准卷积：stem 阶段需要足够的感受野捕获低层纹理
  - [-1, 1, Conv,   [64, 3, 2]]           # 0  P1/2   480×480×64   标准卷积 stem，提取边缘纹理
  - [-1, 1, Conv,   [128, 3, 2]]          # 1  P2/4   240×240×128  标准卷积，裂缝细节特征提取
  - [-1, 2, C3k2,   [256, False, 0.25]]   # 2         浅层特征聚合，保留细长结构信息
  # 第 3-7 层改用深度可分离卷积（DWConv），降低参数量约 40%，满足边缘端推理需求
  - [-1, 1, DWConv, [256, 3, 2]]          # 3  P3/8   120×120×256  深度可分离下采样
  - [-1, 2, C3k2,   [512, False, 0.25]]   # 4         中层语义特征，兼顾裂缝走向与区域信息
  - [-1, 1, DWConv, [512, 3, 2]]          # 5  P4/16   60×60×512   深度可分离下采样
  - [-1, 2, C3k2,   [512, True]]          # 6         深层语义，True 启用大核卷积增大感受野
  - [-1, 1, DWConv, [1024, 3, 2]]         # 7  P5/32   30×30×1024  深度可分离下采样
  - [-1, 2, C3k2,   [1024, True]]         # 8         最深层特征，坑槽等大目标主要在此层检出
  - [-1, 1, SPPF,   [1024, 5]]            # 9         空间金字塔池化，多尺度感受野融合
  - [-1, 2, C2PSA,  [1024]]               # 10        自注意力增强，全局上下文建模

# ==============================================================================
# 检测头 (Detection Head)
# FPN（自顶向下）+ PAN（自底向上）双向特征融合
# 解耦检测头：分类分支与回归分支独立，降低细长目标误检
# ==============================================================================
head:
  # ── FPN 自顶向下路径 ──────────────────────────────────────────────────────
  - [-1,  1, nn.Upsample, [None, 2, "nearest"]]  # 11  P5→P4 上采样
  - [[-1, 6], 1, Concat, [1]]                    # 12  P4 特征融合（跳跃连接）
  - [-1,  2, C3k2, [512, False]]                 # 13  P4 融合后特征精化

  - [-1,  1, nn.Upsample, [None, 2, "nearest"]]  # 14  P4→P3 上采样
  - [[-1, 4], 1, Concat, [1]]                    # 15  P3 特征融合
  - [-1,  2, C3k2, [256, False]]                 # 16  P3/8 输出（裂缝小目标主检层）

  # ── PAN 自底向上路径 ──────────────────────────────────────────────────────
  - [-1,  1, Conv, [256, 3, 2]]                  # 17  P3→P4 下采样
  - [[-1, 13], 1, Concat, [1]]                   # 18  P4 再融合
  - [-1,  2, C3k2, [512, False]]                 # 19  P4/16 输出（中尺度病害检测层）

  - [-1,  1, Conv, [512, 3, 2]]                  # 20  P4→P5 下采样
  - [[-1, 10], 1, Concat, [1]]                   # 21  P5 再融合
  - [-1,  2, C3k2, [1024, True]]                 # 22  P5/32 输出（坑槽大目标检测层）

  # ── 解耦检测头：3 个检测尺度 ─────────────────────────────────────────────
  - [[16, 19, 22], 1, Detect, [nc]]              # 23  LS-Det 输出层（P3 / P4 / P5）
